# # ============ 2种方法的可靠度比较（MTTF） ============
# I
itt=500; n <- 10;  p <- 2
m <- 10;
source("模拟实验/可靠度评估/可靠度比较-I.R")
m <- 20
source("模拟实验/可靠度评估/可靠度比较-I.R")
m <- 30
source("模拟实验/可靠度评估/可靠度比较-I.R")

# II
itt=500; n <- 10;  p <- 3
m <- 10;
source("模拟实验/可靠度评估/fct/可靠度比较-II.R")
m <- 20
source("模拟实验/可靠度评估/fct/可靠度比较-II.R")
m <- 30
source("模拟实验/可靠度评估/fct/可靠度比较-II.R")

# III
itt=500; n <- 10;  p <- 2
m <- 10;
source("模拟实验/可靠度评估/fct/可靠度比较-III.R")
m <- 20
source("模拟实验/可靠度评估/fct/可靠度比较-III.R")
m <- 30
source("模拟实验/可靠度评估/fct/可靠度比较-III.R")

# IV
itt=500; n <- 30;  p <- 3
m <- 10;
source("模拟实验/可靠度评估/fct/可靠度比较-IV.R")
m <- 20
source("模拟实验/可靠度评估/fct/可靠度比较-IV.R")
m <- 30
source("模拟实验/可靠度评估/fct/可靠度比较-IV.R")
